# -*- coding: utf-8 -*-

# Этот файл содержит текстовые константы, которые использует бот

START = 'Привет! Меня зовут Веселый Лишайник.\n' \
        'Я помогу тебе сохранить твои координаты, ' \
        'но для начала тебе необходимо авторизоваться.\nУдачи!'

NEW_TEAM = 'Новая команда'

NAME_TEAM = 'Назови свою команду:'

CHOOSE_TEAM = 'Выбери свою команду из списка:'

SIGNIN_TEAM = 'Войти в команду'

POINT = 'Отправь мне координаты точки (скопируй из Maps.me):'

HEIGHT = 'Отправь мне высоту этой точки (в метрах, без символов):'

SAVE_POINT = 'Ура! Точка записана!\nЗаписать ещё: /coords'

TRY_AGAIN = 'Не получилось!\nПопробуй в таком формате:\n52.13134, 45.856611'

ERROR_REG = 'Не получилось занести координаты так как ты не авторизован. \nАвторизация: /start'

WRONG_POINT = 'Точка с такими координатами уже существует!\nВведи другую: /coords'

ERROR = 'Упс, ты ответил что-то не то. Начни сначала!'

LIST_POINTS = 'Список записанных ранее точек:'

REG_TEAM = 'Команда зарегистрирована!\n' \
           'Теперь ты можешь сохранять свои координаты по команде: /coords'

WHATSUP = 'Ввод координат приостановлен. Что Вы хотите сделать?\n' \
          'Команд не так уж и много...'

LOGIN_TEAM = 'Отлично! Теперь ты можешь записывать ' \
             'свои координаты: /coords'

ERROR_PSW = 'Неверный ввод пароля.\n' \
            'Начни сначала: /start'

ERROR_CONN = 'Не могу соединиться с сервером!' \
             'Проверь настройки сети или обратись к разработчикам.'